//Даны сведения о товарах на складах (несколько!) компании (поля: артикул товара, наименование товара, категория товара, кол-во товара(на данном складе), 
//цена за единицу, склад размещения)
//С помощью запросов узнать:
//- объем товара в денежном эквиваленте по каждом складу
//- максимальную цену по каждой категории
//- среднюю цену товара по каждому складу и по всем складам (всех товаров на складе)
//- определить самый дешевый товар
//- вывести данные по складу, в котором наименьшая суммарная стоимость товаров (вывести все данные)
//Хранение данных: можно несколько классов, может быть один класс
