//Последняя задача по алгоритмизации на 2 семестр:

//Содержатся сведения о производстве товаров работниками (табельный номер, ФИО сотрудника, 
//должность, зарплата, категория товара, кол-во произведённых товаров, цена за единицу товара)

//Необходимо определить:
//1) Кол-во рабочих, которые получают ЗП < сумма выработанной продукции
//2) Кол-во произведённой продукции по каждой категории (в количественном и денежном эквиваленте)
//3) Общий суммарный объём произведённой продукции
//4) Кол-во сотрудников, получающих > 50% от суммы производимого ими продукта
