j/*
На вход подаются данные в виде номера телефона, даты разговора, времени начала разговора, кол-ва минут
1) Необходимо выдать месячный отчёт по общей сумме минут каждого номера
Условия: данные ровно за один месяц, данные подаются в очередь,
чтобы подсчитать сумму минут необходимо с помощью словаря и хеш-таблицы (в качестве ключа - номер телефона, в качестве значения - кол-во минут),
на выходе выдать данные из словаря и из хеш-таблицы

2) Необходимо подсчитать суммарное время за каждую дату
Условия: данные ровно за один месяц, данные подаются в очередь,
чтобы подсчитать сумму минут необходимо с помощью словаря и хеш-таблицы (в качестве ключа - дата, в качестве значения - кол-во минут),
на выходе выдать данные из словаря и из хеш-таблицы
*/
